[{"category":"talent","name":"Body is a Weapon","level":1,"requirement":"Class: Ardent","pillar":"Body Modification","source":"PHB","effect":"You can transform your arms, legs, and even your head into any melee weapon you are proficient with that does NOT require power. This is a Free Action and works just like drawing a weapon. These transformations still occupy a Weapon Slot for combat purposes. You gain +1 Weapon Slot that must be filled with a compatible melee weapon. Your Affinity for any weapon you create in this manner is effectively 2 higher.  This counts as an Axiom Weapon for all mechanical purposes."},{"category":"talent","name":"Axiom Knight","level":1,"requirement":"Class: Ardent","pillar":"Axiom Weapons","source":"PHB","effect":"As part of making an Axiom Weapon attack, you can either manifest the weapon in a square up to 6m away from you, or deploy it to a square 6m away from you. Either way, the Axiom Weapon attack originates from that square instead of your square."},{"category":"talent","name":"Biotic Regen","requirement":"Test","pillar":"Roady","level":0,"effect":"At the start of your turn, if you did not take damage during the enemy turn, you recover 50HP."},{"category":"talent","name":"Sharpshooter","requirement":"","pillar":"","level":0,"effect":"Once per round, when you pull a Chance Card, you may discard it and draw again."},{"category":"talent","name":"Quick Reload","requirement":"","pillar":"","level":0,"effect":"During your turn, you can Discard one Chance Card."},{"category":"talent","name":"Mobile Dodger","requirement":"","pillar":"","level":0,"effect":"Once per turn, you can discard a card from your hand and use a Tier 1 Move Action, including during the Enemy Turn."},{"category":"talent","name":"Dual Wield (Light)","requirement":"","pillar":"","level":0,"effect":"Whenever you make an attack with a 1-Handed Light weapon while dual wielding Light weapons, you can make a Basic Attack with your secondary weapon - OR - You can draw a Chance Card and add it to your hand, then repeat the attack you make with your Primary Attack, but with your Off-Hand weapon. Note: This attack does not need to target the same creature as the triggering attack."},{"category":"talent","name":"Beef Cake","requirement":"","pillar":"","level":0,"effect":"Reduce all Force Movement by ½. You are considered a Large creature for the purpose of determining Force Movements."},{"category":"talent","name":"Diabolic Healer","requirement":"","pillar":"","level":0,"effect":"Each time you activate an ability that deals damage, you can Discard 1 Chance Card from your hand."}]